benchmark_results/results/minimax27/MiniMax_MiniMax-M2.7_in20000_out5000_rate25.log
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7ffa35ad98a0>, trust_remote_code=False, seed=0, num_prompts=500, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=25, model='MiniMax/MiniMax-M2.7', input_len=20000, output_len=5000, tokenizer='./MiniMax-M2.7', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-3926bad9-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 04-14 12:03:17 [datasets.py:700] Sampling input_len from [20000, 20000] and output_len from [5000, 5000]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 25

  0%|          | 0/500 [00:00<?, ?it/s]
  0%|          | 1/500 [02:39<22:07:56, 159.67s/it]
  2%|▏         | 8/500 [02:39<1:59:08, 14.53s/it]  
  3%|▎         | 15/500 [02:39<51:09,  6.33s/it] 
  4%|▍         | 22/500 [02:40<28:11,  3.54s/it]
  5%|▌         | 25/500 [03:00<28:01,  3.54s/it]
  5%|▌         | 26/500 [04:57<1:32:49, 11.75s/it]
  5%|▌         | 27/500 [04:58<1:25:16, 10.82s/it]
  7%|▋         | 33/500 [04:58<48:15,  6.20s/it]  
  8%|▊         | 40/500 [04:59<28:02,  3.66s/it]
 10%|█         | 50/500 [05:10<27:25,  3.66s/it]
 10%|█         | 51/500 [07:34<1:04:59,  8.68s/it]
 10%|█         | 52/500 [07:35<1:01:31,  8.24s/it]
 11%|█         | 54/500 [07:36<52:54,  7.12s/it]  
 12%|█▏        | 59/500 [07:36<34:34,  4.70s/it]
 13%|█▎        | 64/500 [07:36<23:18,  3.21s/it]
 13%|█▎        | 67/500 [07:37<18:30,  2.57s/it]
 14%|█▍        | 69/500 [07:38<15:46,  2.20s/it]
 14%|█▍        | 71/500 [07:39<13:11,  1.84s/it]
 14%|█▍        | 72/500 [07:40<12:15,  1.72s/it]
 15%|█▍        | 74/500 [07:41<09:48,  1.38s/it]
 15%|█▌        | 75/500 [07:41<09:09,  1.29s/it]
 15%|█▌        | 76/500 [10:11<3:21:52, 28.57s/it]
 15%|█▌        | 77/500 [10:12<2:41:13, 22.87s/it]
 16%|█▌        | 78/500 [10:13<2:05:11, 17.80s/it]
 17%|█▋        | 83/500 [10:13<47:04,  6.77s/it]  
 18%|█▊        | 88/500 [10:14<25:02,  3.65s/it]
 18%|█▊        | 92/500 [10:15<16:38,  2.45s/it]
 19%|█▉        | 94/500 [10:16<13:49,  2.04s/it]
 19%|█▉        | 95/500 [10:16<12:45,  1.89s/it]
 19%|█▉        | 97/500 [10:17<10:05,  1.50s/it]
 20%|█▉        | 98/500 [10:18<09:22,  1.40s/it]
 20%|██        | 100/500 [10:19<07:16,  1.09s/it]
 20%|██        | 101/500 [12:42<2:58:49, 26.89s/it]
 20%|██        | 102/500 [12:43<2:23:05, 21.57s/it]
 21%|██        | 103/500 [12:44<1:51:21, 16.83s/it]
 22%|██▏       | 108/500 [12:44<41:58,  6.42s/it]  
 23%|██▎       | 117/500 [12:45<16:07,  2.53s/it]
 25%|██▌       | 125/500 [12:45<09:11,  1.47s/it]
 25%|██▌       | 125/500 [13:00<09:11,  1.47s/it]
 25%|██▌       | 126/500 [15:09<1:13:37, 11.81s/it]
 25%|██▌       | 127/500 [15:11<1:07:10, 10.81s/it]
 26%|██▌       | 128/500 [15:11<59:37,  9.62s/it]  
 26%|██▌       | 129/500 [15:11<50:59,  8.25s/it]
 26%|██▋       | 132/500 [15:12<31:43,  5.17s/it]
 27%|██▋       | 135/500 [15:13<20:57,  3.44s/it]
 27%|██▋       | 137/500 [15:14<16:10,  2.67s/it]
 28%|██▊       | 138/500 [15:14<14:23,  2.39s/it]
 28%|██▊       | 140/500 [15:15<10:44,  1.79s/it]
 28%|██▊       | 142/500 [15:16<08:13,  1.38s/it]
 29%|██▊       | 143/500 [15:17<07:36,  1.28s/it]
 29%|██▉       | 145/500 [15:18<05:51,  1.01it/s]
 29%|██▉       | 147/500 [15:19<04:43,  1.25it/s]
 30%|██▉       | 148/500 [15:20<04:44,  1.24it/s]
 30%|███       | 150/500 [15:20<03:55,  1.48it/s]
 30%|███       | 151/500 [17:29<2:33:12, 26.34s/it]
 30%|███       | 152/500 [17:31<2:00:21, 20.75s/it]
 31%|███       | 153/500 [17:31<1:32:10, 15.94s/it]
 31%|███▏      | 157/500 [17:31<38:26,  6.72s/it]  
 32%|███▏      | 161/500 [17:32<21:10,  3.75s/it]
 33%|███▎      | 165/500 [17:33<13:10,  2.36s/it]
 33%|███▎      | 166/500 [17:34<12:02,  2.16s/it]
 34%|███▎      | 168/500 [17:35<09:28,  1.71s/it]
 34%|███▍      | 170/500 [17:35<07:32,  1.37s/it]
 34%|███▍      | 171/500 [17:36<07:02,  1.28s/it]
 35%|███▍      | 173/500 [17:37<05:31,  1.01s/it]
 35%|███▌      | 175/500 [17:38<04:30,  1.20it/s]
 35%|███▌      | 176/500 [20:33<2:55:09, 32.44s/it]
 35%|███▌      | 177/500 [20:34<2:20:04, 26.02s/it]
 36%|███▌      | 178/500 [20:35<1:48:49, 20.28s/it]
 36%|███▌      | 180/500 [20:35<1:05:38, 12.31s/it]
 37%|███▋      | 185/500 [20:35<27:15,  5.19s/it]  
 38%|███▊      | 188/500 [20:36<18:30,  3.56s/it]
 38%|███▊      | 190/500 [20:37<14:31,  2.81s/it]
 38%|███▊      | 191/500 [20:38<13:00,  2.53s/it]
 39%|███▊      | 193/500 [20:39<09:45,  1.91s/it]
 39%|███▉      | 195/500 [20:40<07:27,  1.47s/it]
 39%|███▉      | 196/500 [20:41<06:51,  1.35s/it]
 40%|███▉      | 198/500 [20:42<05:16,  1.05s/it]
 40%|████      | 200/500 [20:42<04:14,  1.18it/s]
 40%|████      | 201/500 [23:19<2:29:16, 29.96s/it]
 40%|████      | 202/500 [23:20<1:58:34, 23.88s/it]
 41%|████      | 203/500 [23:21<1:31:40, 18.52s/it]
 41%|████      | 205/500 [23:21<54:53, 11.16s/it]  
 42%|████▏     | 210/500 [23:21<22:39,  4.69s/it]
 43%|████▎     | 213/500 [23:22<15:21,  3.21s/it]
 43%|████▎     | 215/500 [23:23<12:03,  2.54s/it]
 43%|████▎     | 217/500 [23:24<09:26,  2.00s/it]
 44%|████▎     | 218/500 [23:25<08:36,  1.83s/it]
 44%|████▍     | 220/500 [23:26<06:34,  1.41s/it]
 44%|████▍     | 222/500 [23:27<05:09,  1.11s/it]
 45%|████▍     | 223/500 [23:28<04:57,  1.08s/it]
 45%|████▌     | 225/500 [23:29<04:00,  1.14it/s]
 45%|████▌     | 226/500 [26:02<2:19:31, 30.55s/it]
 45%|████▌     | 227/500 [26:03<1:49:44, 24.12s/it]
 46%|████▌     | 228/500 [26:03<1:23:35, 18.44s/it]
 46%|████▌     | 229/500 [26:04<1:02:55, 13.93s/it]
 46%|████▌     | 230/500 [26:04<46:47, 10.40s/it]  
 47%|████▋     | 233/500 [26:05<22:07,  4.97s/it]
 47%|████▋     | 237/500 [26:06<11:19,  2.58s/it]
 48%|████▊     | 238/500 [26:07<10:06,  2.31s/it]
 48%|████▊     | 240/500 [26:08<07:32,  1.74s/it]
 48%|████▊     | 242/500 [26:08<05:48,  1.35s/it]
 49%|████▊     | 243/500 [26:09<05:24,  1.26s/it]
 49%|████▉     | 245/500 [26:10<04:09,  1.02it/s]
 49%|████▉     | 247/500 [26:11<03:22,  1.25it/s]
 50%|████▉     | 248/500 [26:12<03:25,  1.23it/s]
 50%|█████     | 250/500 [26:13<02:51,  1.46it/s]
 50%|█████     | 251/500 [28:16<1:44:47, 25.25s/it]
 50%|█████     | 252/500 [28:17<1:22:01, 19.84s/it]
 51%|█████     | 255/500 [28:17<41:36, 10.19s/it]  
 52%|█████▏    | 259/500 [28:18<21:31,  5.36s/it]
 52%|█████▏    | 262/500 [28:19<14:23,  3.63s/it]
 53%|█████▎    | 264/500 [28:20<11:11,  2.84s/it]
 53%|█████▎    | 266/500 [28:21<08:38,  2.22s/it]
 53%|█████▎    | 267/500 [28:21<07:45,  2.00s/it]
 54%|█████▍    | 269/500 [28:22<05:49,  1.51s/it]
 54%|█████▍    | 271/500 [28:23<04:28,  1.17s/it]
 54%|█████▍    | 272/500 [28:24<04:13,  1.11s/it]
 55%|█████▍    | 274/500 [28:25<03:18,  1.14it/s]
 55%|█████▌    | 276/500 [30:52<1:31:54, 24.62s/it]
 55%|█████▌    | 277/500 [30:53<1:14:50, 20.13s/it]
 56%|█████▌    | 281/500 [30:53<35:23,  9.69s/it]  
 57%|█████▋    | 286/500 [30:54<18:10,  5.09s/it]
 58%|█████▊    | 289/500 [30:54<12:58,  3.69s/it]
 58%|█████▊    | 291/500 [30:55<10:20,  2.97s/it]
 58%|█████▊    | 292/500 [30:56<09:16,  2.67s/it]
 59%|█████▉    | 294/500 [30:57<07:02,  2.05s/it]
 59%|█████▉    | 296/500 [30:58<05:23,  1.59s/it]
 59%|█████▉    | 297/500 [30:59<04:56,  1.46s/it]
 60%|█████▉    | 299/500 [30:59<03:45,  1.12s/it]
 60%|██████    | 300/500 [31:00<03:33,  1.07s/it]
 60%|██████    | 301/500 [33:31<1:49:02, 32.88s/it]
 60%|██████    | 302/500 [33:32<1:23:54, 25.43s/it]
 61%|██████    | 306/500 [33:32<35:20, 10.93s/it]  
 62%|██████▏   | 312/500 [33:33<15:35,  4.98s/it]
 63%|██████▎   | 315/500 [33:34<11:15,  3.65s/it]
 63%|██████▎   | 317/500 [33:34<09:02,  2.97s/it]
 64%|██████▍   | 319/500 [33:35<07:09,  2.38s/it]
 64%|██████▍   | 320/500 [33:36<06:27,  2.15s/it]
 64%|██████▍   | 322/500 [33:37<04:54,  1.65s/it]
 65%|██████▍   | 324/500 [33:38<03:47,  1.29s/it]
 65%|██████▌   | 325/500 [33:39<03:32,  1.21s/it]
 65%|██████▌   | 326/500 [35:52<1:19:21, 27.36s/it]
 65%|██████▌   | 327/500 [35:53<1:02:00, 21.50s/it]
 66%|██████▌   | 331/500 [35:53<26:50,  9.53s/it]  
 67%|██████▋   | 337/500 [35:54<11:57,  4.40s/it]
 68%|██████▊   | 341/500 [35:54<07:52,  2.97s/it]
 68%|██████▊   | 342/500 [35:55<07:13,  2.75s/it]
 69%|██████▉   | 344/500 [35:56<05:42,  2.20s/it]
 69%|██████▉   | 346/500 [35:57<04:29,  1.75s/it]
 69%|██████▉   | 347/500 [35:58<04:07,  1.62s/it]
 70%|██████▉   | 349/500 [35:59<03:09,  1.25s/it]
 70%|███████   | 350/500 [36:00<02:57,  1.18s/it]
 70%|███████   | 351/500 [38:17<1:11:50, 28.93s/it]
 70%|███████   | 352/500 [38:18<55:44, 22.60s/it]  
 71%|███████▏  | 357/500 [38:18<20:41,  8.68s/it]
 72%|███████▏  | 362/500 [38:19<10:45,  4.68s/it]
 74%|███████▍  | 371/500 [38:20<04:41,  2.18s/it]
 75%|███████▍  | 373/500 [38:21<04:04,  1.92s/it]
 75%|███████▍  | 374/500 [38:22<03:49,  1.82s/it]
 75%|███████▌  | 375/500 [38:22<03:33,  1.70s/it]
 75%|███████▌  | 376/500 [40:28<40:58, 19.82s/it]
 75%|███████▌  | 377/500 [40:29<33:52, 16.52s/it]
 76%|███████▌  | 378/500 [40:29<26:58, 13.27s/it]
 77%|███████▋  | 384/500 [40:29<09:38,  4.99s/it]
 77%|███████▋  | 387/500 [40:30<06:35,  3.50s/it]
 78%|███████▊  | 391/500 [40:31<04:08,  2.28s/it]
 78%|███████▊  | 392/500 [40:32<03:47,  2.11s/it]
 79%|███████▉  | 394/500 [40:33<02:58,  1.69s/it]
 79%|███████▉  | 396/500 [40:33<02:20,  1.35s/it]
 79%|███████▉  | 397/500 [40:34<02:10,  1.27s/it]
 80%|███████▉  | 399/500 [40:35<01:41,  1.00s/it]
 80%|████████  | 400/500 [40:36<01:37,  1.02it/s]
 80%|████████  | 401/500 [42:51<47:07, 28.56s/it]
 80%|████████  | 402/500 [42:51<36:18, 22.22s/it]
 81%|████████  | 404/500 [42:51<21:34, 13.48s/it]
 82%|████████▏ | 410/500 [42:52<07:37,  5.08s/it]
 83%|████████▎ | 413/500 [42:53<05:12,  3.59s/it]
 83%|████████▎ | 415/500 [42:53<03:58,  2.81s/it]
 83%|████████▎ | 417/500 [42:54<03:04,  2.22s/it]
 84%|████████▎ | 418/500 [42:55<02:45,  2.02s/it]
 84%|████████▍ | 420/500 [42:56<02:03,  1.54s/it]
 84%|████████▍ | 422/500 [42:56<01:33,  1.20s/it]
 85%|████████▍ | 423/500 [42:57<01:27,  1.14s/it]
 85%|████████▌ | 425/500 [42:58<01:07,  1.12it/s]
 85%|████████▌ | 426/500 [45:21<34:55, 28.32s/it]
 85%|████████▌ | 427/500 [45:22<27:12, 22.36s/it]
 86%|████████▌ | 431/500 [45:22<11:31, 10.02s/it]
 88%|████████▊ | 439/500 [45:23<04:00,  3.94s/it]
 89%|████████▊ | 443/500 [45:24<02:39,  2.80s/it]
 89%|████████▉ | 445/500 [45:24<02:10,  2.38s/it]
 89%|████████▉ | 446/500 [45:25<01:58,  2.20s/it]
 90%|████████▉ | 448/500 [45:26<01:31,  1.77s/it]
 90%|████████▉ | 449/500 [45:27<01:23,  1.63s/it]
 90%|█████████ | 451/500 [47:49<18:11, 22.28s/it]
 90%|█████████ | 452/500 [47:50<14:48, 18.50s/it]
 91%|█████████ | 456/500 [47:50<06:47,  9.25s/it]
 92%|█████████▏| 461/500 [47:50<03:12,  4.94s/it]
 93%|█████████▎| 464/500 [47:51<02:09,  3.60s/it]
 93%|█████████▎| 466/500 [47:52<01:38,  2.91s/it]
 93%|█████████▎| 467/500 [47:53<01:26,  2.62s/it]
 94%|█████████▍| 469/500 [47:53<01:02,  2.02s/it]
 94%|█████████▍| 471/500 [47:54<00:45,  1.57s/it]
 94%|█████████▍| 472/500 [47:55<00:40,  1.44s/it]
 95%|█████████▍| 474/500 [47:56<00:28,  1.11s/it]
 95%|█████████▌| 475/500 [47:57<00:26,  1.06s/it]
 95%|█████████▌| 476/500 [50:18<12:17, 30.74s/it]
 95%|█████████▌| 477/500 [50:18<09:03, 23.65s/it]
 96%|█████████▋| 482/500 [50:18<02:40,  8.91s/it]
 98%|█████████▊| 492/500 [50:18<00:25,  3.21s/it]
100%|██████████| 500/500 [50:19<00:00,  6.04s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     500       
Failed requests:                         0         
Maximum request concurrency:             25        
Benchmark duration (s):                  3019.03   
Total input tokens:                      10000000  
Total generated tokens:                  2500000   
Request throughput (req/s):              0.17      
Output token throughput (tok/s):         828.08    
Peak output token throughput (tok/s):    1100.00   
Peak concurrent requests:                41.00     
Total token throughput (tok/s):          4140.40   
---------------Time to First Token----------------
Mean TTFT (ms):                          5047.64   
Median TTFT (ms):                        5068.08   
P99 TTFT (ms):                           12933.09  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          29.18     
Median TPOT (ms):                        28.83     
P99 TPOT (ms):                           36.22     
---------------Inter-token Latency----------------
Mean ITL (ms):                           29.20     
Median ITL (ms):                         27.07     
P99 ITL (ms):                            35.74     
==================================================